STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257fxx_ca35.h
   CSI_IRQn                         = 174,     /*!< CSI interrupt                                                       */
   DSI_IRQn                         = 175,     /*!< DSI Host controller global interrupt                                */
   CRYP1_IRQn                       = 176,     /*!< Crypto1 interrupt                                                   */
   HASH_IRQn                        = 177,     /*!< Hash interrupt                                                      */
   PKA_IRQn                         = 178,     /*!< PKA interrupt                                                       */
   RESERVED_179                     = 179,     /*!< reserved                                                            */
   UART7_IRQn                       = 180,     /*!< UART7 interrupt                                                     */
   UART8_IRQn                       = 181,     /*!< UART8 interrupt                                                     */
   UART9_IRQn                       = 182,     /*!< UART9 interrupt                                                     */
   LPUART1_IRQn                     = 183,     /*!< LPUART1 interrupt                                                   */
   SPI4_IRQn                        = 184,     /*!< SPI4 global interrupt                                               */
   SPI5_IRQn                        = 185,     /*!< SPI5 global interrupt                                               */
   SPI6_IRQn                        = 186,     /*!< SPI6 global interrupt                                               */
   SPI7_IRQn                        = 187,     /*!< SPI7 global interrupt                                               */
   SPI8_IRQn                        = 188,     /*!< SPI8 global interrupt                                               */
   SAI1_IRQn                        = 189,     /*!< SAI1 global interrupt                                               */
   LTDC_IRQn                        = 190,     /*!< LTDC global interrupt                                               */
   LTDC_ER_IRQn                     = 191,     /*!< LTDC global error interrupt                                         */
   LTDC_SEC_IRQn                    = 192,     /*!< LTDC security global interrupt                                      */
   LTDC_SEC_ER_IRQn                 = 193,     /*!< LTDC security global error interrupt                                */
   SAI2_IRQn                        = 194,     /*!< SAI2 global interrupt                                               */
   OCTOSPI1_IRQn                    = 195,     /*!< OCTOSPI1 global interrupt                                           */
   OCTOSPI2_IRQn                    = 196,     /*!< OCTOSPI2 global interrupt                                           */
   OTFDEC1_IRQn                     = 197,     /*!< OTFDEC1 interrupt                                                   */
   LPTIM1_IRQn                      = 198,     /*!< LPTIMER1 interrupt                                                  */
   VENC_IRQn                        = 199,     /*!< VENC global interrupt                                               */
   I2C4_IRQn                        = 200,     /*!< I2C4 global interrupt                                               */
   USBH_WAKEUP_IRQn                 = 201,     /*!< USB Host remote wake up from USB2PHY1 interrupt                     */
   SPDIFRX_IRQn                     = 202,     /*!< SPDIFRX global interrupt                                            */
   IPCC1_RX_IRQn                    = 203,     /*!< Mailbox 1 RX Occupied interrupt                                     */
   IPCC1_TX_IRQn                    = 204,     /*!< Mailbox 1 TX Free interrupt                                         */
   IPCC1_RX_S_IRQn                  = 205,     /*!< Mailbox 1 RX Occupied secure interrupt                              */
   IPCC1_TX_S_IRQn                  = 206,     /*!< Mailbox 1 TX Free secure interrupt                                  */
   IPCC2_RX_IRQn                    = 207,     /*!< Mailbox 2 RX Occupied interrupt                                     */
   IPCC2_TX_IRQn                    = 208,     /*!< Mailbox 2 TX Free interrupt                                         */
   IPCC2_RX_S_IRQn                  = 209,     /*!< Mailbox 2 RX Occupied secure interrupt                              */
   IPCC2_TX_S_IRQn                  = 210,     /*!< Mailbox 2 TX Free secure interrupt                                  */
   SAES_IRQn                        = 211,     /*!< secure AES                                                          */
   CRYP2_IRQn                       = 212,     /*!< Crypto2 interrupt                                                   */
   I2C5_IRQn                        = 213,     /*!< I2C5 global interrupt                                               */
   USB3DR_WAKEUP_IRQn               = 214,     /*!< USB3DR remote wake up from USB2PHY1 interrupt                       */
   GPU_IRQn                         = 215,     /*!< GPU global interrupt                                                */
   MDF1_FLT0_IRQn                   = 216,     /*!< MDF1 Filter0 interrupt                                              */
   MDF1_FLT1_IRQn                   = 217,     /*!< MDF1 Filter1 interrupt                                              */
   MDF1_FLT2_IRQn                   = 218,     /*!< MDF1 Filter2 interrupt                                              */
   MDF1_FLT3_IRQn                   = 219,     /*!< MDF1 Filter3 interrupt                                              */
   MDF1_FLT4_IRQn                   = 220,     /*!< MDF1 Filter4 interrupt                                              */
   MDF1_FLT5_IRQn                   = 221,     /*!< MDF1 Filter5 interrupt                                              */
   MDF1_FLT6_IRQn                   = 222,     /*!< MDF1 Filter6 interrupt                                              */
   MDF1_FLT7_IRQn                   = 223,     /*!< MDF1 Filter7 interrupt                                              */
   SAI3_IRQn                        = 224,     /*!< SAI3 global interrupt                                               */
   TIM15_IRQn                       = 225,     /*!< TIMER15 global interrupt                                            */
   TIM16_IRQn                       = 226,     /*!< TIMER16 global interrupt                                            */
   TIM17_IRQn                       = 227,     /*!< TIMER17 global interrupt                                            */
   TIM12_IRQn                       = 228,     /*!< TIMER12 global interrupt                                            */
   SDMMC2_IRQn                      = 229,     /*!< SDMMC2 global interrupt                                             */
   DCMIPP_IRQn                      = 230,     /*!< DCMIPP global interrupt                                             */
   HSEM_IRQn                        = 231,     /*!< HSEM non secure interrupt                                           */
   HSEM_S_IRQn                      = 232,     /*!< HSEM secure interrupt                                               */
   RESERVED_233                     = 233,     /*!< reserved                                                            */
   CPU2_SYSRESETQ_IRQn              = 234,     /*!< Cortex-M33 local Reset Request through EXTI                         */
   TIM13_IRQn                       = 235,     /*!< TIMER13 global interrupt                                            */
   TIM14_IRQn                       = 236,     /*!< TIMER14 global interrupt                                            */
   TIM10_IRQn                       = 237,     /*!< TIMER10 global interrupt                                            */
   RNG_IRQn                         = 238,     /*!< RNG global interrupt                                                */
   ADF1_FLT_IRQn                    = 239,     /*!< ADF1 Filter interrupt                                               */
   I2C6_IRQn                        = 240,     /*!< I2C6 global interrupt                                               */
   COMBOPHY_WAKEUP_IRQn             = 241,     /*!< COMBOPHY LFPS start request interrupt                               */
   I2C7_IRQn                        = 242,     /*!< I2C7 global interrupt                                               */
   RESERVED_243                     = 243,     /*!< reserved                                                            */
   I2C8_IRQn                        = 244,     /*!< I2C8 global interrupt                                               */
   I3C4_IRQn                        = 245,     /*!< I3C4 global interrupt                                               */
   SDMMC3_IRQn                      = 246,     /*!< SDMMC3 global interrupt                                             */
   LPTIM2_IRQn                      = 247,     /*!< LPTIMER2 interrupt                                                  */
   LPTIM3_IRQn                      = 248,     /*!< LPTIMER3 interrupt                                                  */
   LPTIM4_IRQn                      = 249,     /*!< LPTIMER4 interrupt                                                  */
   LPTIM5_IRQn                      = 250,     /*!< LPTIMER5 interrupt                                                  */
   OTFDEC2_IRQn                     = 251,     /*!< OTFDEC2 interrupt                                                   */
   CPU2_SEV_IRQn                    = 252,     /*!< Cortex-M33 Send Event through EXTI                                  */
   CPU3_SEV_IRQn                    = 253,     /*!< Cortex-M0+ Send Event through EXTI                                  */
   RCC_WAKEUP_IRQn                  = 254,     /*!< RCC CPU1 Wake up interrupt                                          */
   SAI4_IRQn                        = 255,     /*!< SAI4 global interrupt                                               */
   DTS_IRQn                         = 256,     /*!< Temperature sensor interrupt                                        */
   TIM11_IRQn                       = 257,     /*!< TIMER11 global interrupt                                            */
   CPU1_WAKEUP_PIN_IRQn             = 258,     /*!< Interrupt for all 6 wake-up enabled by CPU1                         */
   USB3DR_BC_IRQn                   = 259,     /*!< USB3 BC interrupt                                                   */
   USB3DR_IRQn                      = 260,     /*!< USB3 interrupt                                                      */
   UCPD1_IRQn                       = 261,     /*!< UCPD1 interrupt                                                     */
   RESERVED_262                     = 262,     /*!< reserved                                                            */
   PCIE_AER_IRQn                    = 263,     /*!< PCIe Error interrupt                                                */
   PCIE_AERM_IRQn                   = 264,     /*!< PCIe Error Message interrupt                                        */
   PCIE_BW_IRQn                     = 265,     /*!< PCIe Bandwidth management interrupt                                 */
   PCIE_BWM_IRQn                    = 266,     /*!< PCIe Bandwidth management Message interrupt                         */
   PCIE_BWAUTO_IRQn                 = 267,     /*!< PCIe Auto Bandwidth interrupt                                       */
   PCIE_BWAUTOM_IRQn                = 268,     /*!< PCIe Auto Bandwidth Message interrupt                               */
   PCIE_PME_IRQn                    = 269,     /*!< PCIe Power Management interrupt                                     */
   PCIE_PMEM_IRQn                   = 270,     /*!< PCIe Power Management Message interrupt                             */
   PCIE_SYSERR_IRQn                 = 271,     /*!< PCIe System Error interrupt                                         */
   SERF_IRQn                        = 272,     /*!< SERF global interrupt                                               */
   BUSPERFM_IRQn                    = 273,     /*!< BUS Performance Monitor interrupt                                   */
   RAMCFG_IRQn                      = 274,     /*!< RAM configuration global interrupt                                  */
   DDRCTRL_IRQn                     = 275,     /*!< DDRCTRL interrupt                                                   */
   DDRPHYC_IRQn                     = 276,     /*!< DDRPHY interrupt (active low)                                       */
   DFI_ERR_IRQn                     = 277,     /*!< DDRPHY DFI error interrupt                                          */
   IAC_IRQn                         = 278,     /*!< RIF Illegal access controller interrupt                             */
   VDDCPU_VD_IRQn                   = 279,     /*!< VDDCPU voltage detector interrupt                                   */
   VDDCORE_VD_IRQn                  = 280,     /*!< VDDCORE voltage detector interrupt                                  */
   RETRAMCRC_ERR_IRQn               = 281,     /*!< RETRAM CRC error interrupt                                          */
   ETHSW_IRQn                       = 282,     /*!< Ethernet Switch global interrupt                                    */
   ETHSW_MSGBUF_IRQn                = 283,     /*!< Ethernet ACM Message buffer interrupt                               */
   ETHSW_FSC_IRQn                   = 284,     /*!< Ethernet ACM Scheduler interrupt                                    */
   HPDMA1_WKUP_IRQn                 = 285,     /*!< HPDMA1 channel 0 to 15 wake up                                      */
   HPDMA2_WKUP_IRQn                 = 286,     /*!< HPDMA2 channel 0 to 15 wake up                                      */
   HPDMA3_WKUP_IRQn                 = 287,     /*!< HPDMA3 channel 0 to 15 wake up                                      */
   LPDMA_WKUP_IRQn                  = 288,     /*!< LPDMA channel 0 to 3 wake up                                        */
   UCPD1_VBUS_IRQn                  = 289,     /*!< USB TypeC VBUS valid interrupt                                      */
   UCPD1_VSAFE5V_IRQn               = 290,     /*!< USB TypeC VSAFE5V valid interrupt                                   */
   RCC_HSI_FMON_IRQn                = 291,     /*!< HSI Frequency Monitor interrupt                                     */
   VDDGPU_VD_IRQn                   = 292,     /*!< VDDGPU voltage detector interrupt                                   */
   RESERVED_293                     = 293,     /*!< reserved                                                            */
   PCIE_PTMRDY_IRQn                 = 294,     /*!< PCIe PTM responder ready interrupt                                  */
   PCIE_PTMUPD_IRQn                 = 295,     /*!< PCIe PTM clock updated interrupt                                    */
   PCIE_INTA_IRQn                   = 296,     /*!< PCIe legacy interrupt A                                             */
   PCIE_INTB_IRQn                   = 297,     /*!< PCIe legacy interrupt B                                             */
   PCIE_INTC_IRQn                   = 298,     /*!< PCIe legacy interrupt C                                             */
   PCIE_INTD_IRQn                   = 299,     /*!< PCIe legacy interrupt D                                             */
   EXTI1_0_IRQn                     = 300,     /*!< EXTI1 Line 0 interrupt                                              */
   EXTI1_1_IRQn                     = 301,     /*!< EXTI1 Line 1 interrupt                                              */
   EXTI1_2_IRQn                     = 302,     /*!< EXTI1 Line 2 interrupt                                              */
   EXTI1_3_IRQn                     = 303,     /*!< EXTI1 Line 3 interrupt                                              */
   EXTI1_4_IRQn                     = 304,     /*!< EXTI1 Line 4 interrupt                                              */
   EXTI1_5_IRQn                     = 305,     /*!< EXTI1 Line 5 interrupt                                              */
   EXTI1_6_IRQn                     = 306,     /*!< EXTI1 Line 6 interrupt                                              */
   EXTI1_7_IRQn                     = 307,     /*!< EXTI1 Line 7 interrupt                                              */
   EXTI1_8_IRQn                     = 308,     /*!< EXTI1 Line 8 interrupt                                              */
   EXTI1_9_IRQn                     = 309,     /*!< EXTI1 Line 9 interrupt                                              */
   EXTI1_10_IRQn                    = 310,     /*!< EXTI1 Line 10 interrupt                                             */
   EXTI1_11_IRQn                    = 311,     /*!< EXTI1 Line 11 interrupt                                             */
   EXTI1_12_IRQn                    = 312,     /*!< EXTI1 Line 12 interrupt                                             */
   EXTI1_13_IRQn                    = 313,     /*!< EXTI1 Line 13 interrupt                                             */
   EXTI1_14_IRQn                    = 314,     /*!< EXTI1 Line 14 interrupt                                             */
   EXTI1_15_IRQn                    = 315,     /*!< EXTI1 Line 15 interrupt                                             */
   RESERVED_316                     = 316,     /*!< reserved                                                            */
   RESERVED_317                     = 317,     /*!< reserved                                                            */
   RESERVED_318                     = 318,     /*!< reserved                                                            */
   RESERVED_319                     = 319,     /*!< reserved                                                            */
   RESERVED_320                     = 320,     /*!< reserved                                                            */
   RESERVED_321                     = 321,     /*!< reserved                                                            */
   RESERVED_322                     = 322,     /*!< reserved                                                            */
   RESERVED_323                     = 323,     /*!< reserved                                                            */
   RESERVED_324                     = 324,     /*!< reserved                                                            */
   RESERVED_325                     = 325,     /*!< reserved                                                            */
   RESERVED_326                     = 326,     /*!< reserved                                                            */
   RESERVED_327                     = 327,     /*!< reserved                                                            */
   RESERVED_328                     = 328,     /*!< reserved                                                            */
   RESERVED_329                     = 329,     /*!< reserved                                                            */
   RESERVED_330                     = 330,     /*!< reserved                                                            */
   RESERVED_331                     = 331,     /*!< reserved                                                            */
   RESERVED_332                     = 332,     /*!< reserved                                                            */
   RESERVED_333                     = 333,     /*!< reserved                                                            */
   RESERVED_334                     = 334,     /*!< reserved                                                            */
   RESERVED_335                     = 335,     /*!< reserved                                                            */
   RESERVED_336                     = 336,     /*!< reserved                                                            */
   RESERVED_337                     = 337,     /*!< reserved                                                            */
   RESERVED_338                     = 338,     /*!< reserved                                                            */
   RESERVED_339                     = 339,     /*!< reserved                                                            */
   IS2M_IRQn                        = 340,     /*!< IS2M fault detection interrupt                                      */
   L2WERR_IRQn                      = 341,     /*!< Interrupt from L2 memory transaction with a write response error    */
   DDRPERFM_IRQn                    = 342,     /*!< DDR Performance Monitor interrupt                                   */
   RESERVED_343                     = 343,     /*!< reserved                                                            */
   PMSTAT0_IRQn                     = 344,     /*!< Power management, PLL and sensor interrupt #0                       */
   PMSTAT1_IRQn                     = 345,     /*!< Power management, PLL and sensor interrupt #1                       */
   PMSTAT2_IRQn                     = 346,     /*!< Power management, PLL and sensor interrupt #2                       */
   PMSTAT3_IRQn                     = 347,     /*!< Power management, PLL and sensor interrupt #3                       */
   PMSTAT4_IRQn                     = 348,     /*!< Power management, PLL and sensor interrupt #4                       */
   PMSTAT5_IRQn                     = 349,     /*!< Power management, PLL and sensor interrupt #5                       */
   PMSTAT6_IRQn                     = 350,     /*!< Power management, PLL and sensor interrupt #6                       */
   PMSTAT7_IRQn                     = 351,     /*!< Power management, PLL and sensor interrupt #7                       */
   PMSTAT8_IRQn                     = 352,     /*!< Power management, PLL and sensor interrupt #8                       */
   PMSTAT9_IRQn                     = 353,     /*!< Power management, PLL and sensor interrupt #9                       */
   PMSTAT10_IRQn                    = 354,     /*!< Power management, PLL and sensor interrupt #10                      */
   PMSTAT11_IRQn                    = 355,     /*!< Power management, PLL and sensor interrupt #11                      */
   PMSTAT12_IRQn                    = 356,     /*!< Power management, PLL and sensor interrupt #12                      */
   PMSTAT13_IRQn                    = 357,     /*!< Power management, PLL and sensor interrupt #13                      */
   PMSTAT14_IRQn                    = 358,     /*!< Power management, PLL and sensor interrupt #14                      */
   PMSTAT15_IRQn                    = 359,     /*!< Power management, PLL and sensor interrupt #15                      */
   PMSTAT16_IRQn                    = 360,     /*!< Power management, PLL and sensor interrupt #16                      */
   PCIE_MSIGBL_IRQn                 = 361,     /*!< PCIe MSI global interrupt                                           */
   PCIE_MSI0_IRQn                   = 362,     /*!< PCIe MSI interrupt #0                                               */
   PCIE_MSI1_IRQn                   = 363,     /*!< PCIe MSI interrupt #1                                               */
   PCIE_MSI2_IRQn                   = 364,     /*!< PCIe MSI interrupt #2                                               */
   PCIE_MSI3_IRQn                   = 365,     /*!< PCIe MSI interrupt #3                                               */
   PCIE_MSI4_IRQn                   = 366,     /*!< PCIe MSI interrupt #4                                               */
   PCIE_MSI5_IRQn                   = 367,     /*!< PCIe MSI interrupt #5                                               */
   PCIE_MSI6_IRQn                   = 368,     /*!< PCIe MSI interrupt #6                                               */
