STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257fxx_ca35.h
/*****************  Bit definition for BSEC_UNMAPR register  ******************/
#define BSEC_UNMAPR_UNMAP_Pos         (0U)
#define BSEC_UNMAPR_UNMAP_Msk         (0xFFFFFFFFUL << BSEC_UNMAPR_UNMAP_Pos)  /*!< 0xFFFFFFFF */
#define BSEC_UNMAPR_UNMAP             BSEC_UNMAPR_UNMAP_Msk                   /*!< unmap key */

/*******************  Bit definition for BSEC_SR register  ********************/
#define BSEC_SR_HVALID_Pos            (1U)
#define BSEC_SR_HVALID_Msk            (0x1UL << BSEC_SR_HVALID_Pos)            /*!< 0x00000002 */
#define BSEC_SR_HVALID                BSEC_SR_HVALID_Msk                      /*!< Hardware key valid */
#define BSEC_SR_NVSTATE_Pos           (26U)
#define BSEC_SR_NVSTATE_Msk           (0x3FUL << BSEC_SR_NVSTATE_Pos)          /*!< 0xFC000000 */
#define BSEC_SR_NVSTATE               BSEC_SR_NVSTATE_Msk                     /*!< Non-volatile state */

/******************  Bit definition for BSEC_OTPSR register  ******************/
#define BSEC_OTPSR_BUSY_Pos           (0U)
#define BSEC_OTPSR_BUSY_Msk           (0x1UL << BSEC_OTPSR_BUSY_Pos)           /*!< 0x00000001 */
#define BSEC_OTPSR_BUSY               BSEC_OTPSR_BUSY_Msk                     /*!< Busy flag */
#define BSEC_OTPSR_INIT_DONE_Pos       (1U)
#define BSEC_OTPSR_INIT_DONE_Msk       (0x1UL << BSEC_OTPSR_INIT_DONE_Pos)        /*!< 0x00000002 */
#define BSEC_OTPSR_INIT_DONE           BSEC_OTPSR_INIT_DONE_Msk                  /*!< Initialization done */
#define BSEC_OTPSR_HIDEUP_Pos          (2U)
#define BSEC_OTPSR_HIDEUP_Msk          (0x1UL << BSEC_OTPSR_HIDEUP_Pos)             /*!< 0x00000004 */
#define BSEC_OTPSR_HIDEUP              BSEC_OTPSR_HIDEUP_Msk                       /*!< Hide upper fuse words */
#define BSEC_OTPSR_OTPNVIR_Pos         (4U)
#define BSEC_OTPSR_OTPNVIR_Msk         (0x1UL << BSEC_OTPSR_OTPNVIR_Pos)            /*!< 0x00000010 */
#define BSEC_OTPSR_OTPNVIR             BSEC_OTPSR_OTPNVIR_Msk                      /*!< OTP not virgin */
#define BSEC_OTPSR_OTPERR_Pos          (5U)
#define BSEC_OTPSR_OTPERR_Msk          (0x1UL << BSEC_OTPSR_OTPERR_Pos)             /*!< 0x00000020 */
#define BSEC_OTPSR_OTPERR              BSEC_OTPSR_OTPERR_Msk                       /*!< OTP with error */
#define BSEC_OTPSR_OTPSEC_Pos          (6U)
#define BSEC_OTPSR_OTPSEC_Msk          (0x1UL << BSEC_OTPSR_OTPSEC_Pos)             /*!< 0x00000040 */
#define BSEC_OTPSR_OTPSEC              BSEC_OTPSR_OTPSEC_Msk                       /*!< OTP with single error correction */
#define BSEC_OTPSR_PROGFAIL_Pos        (16U)
#define BSEC_OTPSR_PROGFAIL_Msk        (0x1UL << BSEC_OTPSR_PROGFAIL_Pos)           /*!< 0x00010000 */
#define BSEC_OTPSR_PROGFAIL            BSEC_OTPSR_PROGFAIL_Msk                     /*!< Programming failed */
#define BSEC_OTPSR_DISTURBF_Pos        (17U)
#define BSEC_OTPSR_DISTURBF_Msk        (0x1UL << BSEC_OTPSR_DISTURBF_Pos)           /*!< 0x00020000 */
#define BSEC_OTPSR_DISTURBF            BSEC_OTPSR_DISTURBF_Msk                     /*!< Disturb flag */
#define BSEC_OTPSR_DEDF_Pos            (18U)
#define BSEC_OTPSR_DEDF_Msk            (0x1UL << BSEC_OTPSR_DEDF_Pos)               /*!< 0x00040000 */
#define BSEC_OTPSR_DEDF                BSEC_OTPSR_DEDF_Msk                         /*!< Double error detection flag */
#define BSEC_OTPSR_SECF_Pos            (19U)
#define BSEC_OTPSR_SECF_Msk            (0x1UL << BSEC_OTPSR_SECF_Pos)               /*!< 0x00080000 */
#define BSEC_OTPSR_SECF                BSEC_OTPSR_SECF_Msk                         /*!< Single error correction flag */
#define BSEC_OTPSR_PPLF_Pos            (20U)
#define BSEC_OTPSR_PPLF_Msk            (0x1UL << BSEC_OTPSR_PPLF_Pos)               /*!< 0x00100000 */
#define BSEC_OTPSR_PPLF                BSEC_OTPSR_PPLF_Msk                         /*!< Permanent programming lock flag */
#define BSEC_OTPSR_PPLMF_Pos           (21U)
#define BSEC_OTPSR_PPLMF_Msk           (0x1UL << BSEC_OTPSR_PPLMF_Pos)              /*!< 0x00200000 */
#define BSEC_OTPSR_PPLMF               BSEC_OTPSR_PPLMF_Msk                        /*!< Permanent programming lock mismatch flag */
#define BSEC_OTPSR_AMEF_Pos            (22U)
#define BSEC_OTPSR_AMEF_Msk            (0x1UL << BSEC_OTPSR_AMEF_Pos)               /*!< 0x00400000 */
#define BSEC_OTPSR_AMEF                BSEC_OTPSR_AMEF_Msk                         /*!< Addresses mismatch error flag */


/*****************  Bit definition for BSEC_WOSCRx register  ******************/
#define BSEC_WOSCRx_WOSDATA_Pos        (0U)
#define BSEC_WOSCRx_WOSDATA_Msk        (0xFFFFFFFFUL << BSEC_WOSCRx_WOSDATA_Pos)    /*!< 0xFFFFFFFF */
#define BSEC_WOSCRx_WOSDATA            BSEC_WOSCRx_WOSDATA_Msk                      /*!< Write once scratch data */

/******************  Bit definition for BSEC_HRCR register  *******************/
#define BSEC_HRCR_HRC_Pos             (0U)
#define BSEC_HRCR_HRC_Msk             (0xFFFFFFFFUL << BSEC_HRCR_HRC_Pos)      /*!< 0xFFFFFFFF */
#define BSEC_HRCR_HRC                 BSEC_HRCR_HRC_Msk                       /*!< hot reset counter */

/******************  Bit definition for BSEC_WRCR register  *******************/
#define BSEC_WRCR_WRC_Pos             (0U)
#define BSEC_WRCR_WRC_Msk             (0xFFFFFFFFUL << BSEC_WRCR_WRC_Pos)      /*!< 0xFFFFFFFF */
#define BSEC_WRCR_WRC                 BSEC_WRCR_WRC_Msk                       /*!< warm reset counter */

/******************  Bit definition for BSEC_VERR register  *******************/
#define BSEC_VERR_MINREV_Pos          (0U)
#define BSEC_VERR_MINREV_Msk          (0xFUL << BSEC_VERR_MINREV_Pos)          /*!< 0x0000000F */
#define BSEC_VERR_MINREV              BSEC_VERR_MINREV_Msk                    /*!< minor revision information */
#define BSEC_VERR_MAJREV_Pos          (4U)
#define BSEC_VERR_MAJREV_Msk          (0xFUL << BSEC_VERR_MAJREV_Pos)          /*!< 0x000000F0 */
#define BSEC_VERR_MAJREV              BSEC_VERR_MAJREV_Msk                    /*!< major revision information */

/******************  Bit definition for BSEC_IPIDR register  ******************/
#define BSEC_IPIDR_ID_Pos             (0U)
#define BSEC_IPIDR_ID_Msk             (0xFFFFFFFFUL << BSEC_IPIDR_ID_Pos)      /*!< 0xFFFFFFFF */
#define BSEC_IPIDR_ID                 BSEC_IPIDR_ID_Msk                       /*!< BSEC identification */

