STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257fxx_ca35.h
/*******************  Bit definition for DSI_VCCR register  *******************/
#define DSI_VCCR_NUMC_Pos           (0U)
#define DSI_VCCR_NUMC_Msk           (0x1FFFUL << DSI_VCCR_NUMC_Pos)       /*!< 0x00001FFF */
#define DSI_VCCR_NUMC               DSI_VCCR_NUMC_Msk                    /*!< Number of chunks */

/******************  Bit definition for DSI_VNPCR register  *******************/
#define DSI_VNPCR_NPSIZE_Pos        (0U)
#define DSI_VNPCR_NPSIZE_Msk        (0x1FFFUL << DSI_VNPCR_NPSIZE_Pos)    /*!< 0x00001FFF */
#define DSI_VNPCR_NPSIZE            DSI_VNPCR_NPSIZE_Msk                 /*!< Null packet size */

/******************  Bit definition for DSI_VHSACR register  ******************/
#define DSI_VHSACR_HSA_Pos          (0U)
#define DSI_VHSACR_HSA_Msk          (0xFFFUL << DSI_VHSACR_HSA_Pos)       /*!< 0x00000FFF */
#define DSI_VHSACR_HSA              DSI_VHSACR_HSA_Msk                   /*!< Horizontal synchronism active duration */

/******************  Bit definition for DSI_VHBPCR register  ******************/
#define DSI_VHBPCR_HBP_Pos          (0U)
#define DSI_VHBPCR_HBP_Msk          (0xFFFUL << DSI_VHBPCR_HBP_Pos)       /*!< 0x00000FFF */
#define DSI_VHBPCR_HBP              DSI_VHBPCR_HBP_Msk                   /*!< Horizontal back-porch duration */

/*******************  Bit definition for DSI_VLCR register  *******************/
#define DSI_VLCR_HLINE_Pos          (0U)
#define DSI_VLCR_HLINE_Msk          (0x7FFFUL << DSI_VLCR_HLINE_Pos)      /*!< 0x00007FFF */
#define DSI_VLCR_HLINE              DSI_VLCR_HLINE_Msk                   /*!< Horizontal line duration */

/******************  Bit definition for DSI_VVSACR register  ******************/
#define DSI_VVSACR_VSA_Pos          (0U)
#define DSI_VVSACR_VSA_Msk          (0x3FFUL << DSI_VVSACR_VSA_Pos)       /*!< 0x000003FF */
#define DSI_VVSACR_VSA              DSI_VVSACR_VSA_Msk                   /*!< Vertical synchronism active duration */

/******************  Bit definition for DSI_VVBPCR register  ******************/
#define DSI_VVBPCR_VBP_Pos          (0U)
#define DSI_VVBPCR_VBP_Msk          (0x3FFUL << DSI_VVBPCR_VBP_Pos)       /*!< 0x000003FF */
#define DSI_VVBPCR_VBP              DSI_VVBPCR_VBP_Msk                   /*!< Vertical back-porch duration */

/******************  Bit definition for DSI_VVFPCR register  ******************/
#define DSI_VVFPCR_VFP_Pos          (0U)
#define DSI_VVFPCR_VFP_Msk          (0x3FFUL << DSI_VVFPCR_VFP_Pos)       /*!< 0x000003FF */
#define DSI_VVFPCR_VFP              DSI_VVFPCR_VFP_Msk                   /*!< Vertical front-porch duration */

/******************  Bit definition for DSI_VVACR register  *******************/
#define DSI_VVACR_VA_Pos            (0U)
#define DSI_VVACR_VA_Msk            (0x3FFFUL << DSI_VVACR_VA_Pos)        /*!< 0x00003FFF */
#define DSI_VVACR_VA                DSI_VVACR_VA_Msk                     /*!< Vertical active duration */

/*******************  Bit definition for DSI_LCCR register  *******************/
#define DSI_LCCR_CMDSIZE_Pos        (0U)
#define DSI_LCCR_CMDSIZE_Msk        (0xFFFFUL << DSI_LCCR_CMDSIZE_Pos)    /*!< 0x0000FFFF */
#define DSI_LCCR_CMDSIZE            DSI_LCCR_CMDSIZE_Msk                 /*!< Command size */

/*******************  Bit definition for DSI_CMCR register  *******************/
#define DSI_CMCR_TEARE_Pos          (0U)
#define DSI_CMCR_TEARE_Msk          (0x1UL << DSI_CMCR_TEARE_Pos)         /*!< 0x00000001 */
#define DSI_CMCR_TEARE              DSI_CMCR_TEARE_Msk                   /*!< Tearing effect acknowledge request enable */
#define DSI_CMCR_ARE_Pos            (1U)
#define DSI_CMCR_ARE_Msk            (0x1UL << DSI_CMCR_ARE_Pos)           /*!< 0x00000002 */
#define DSI_CMCR_ARE                DSI_CMCR_ARE_Msk                     /*!< Acknowledge request enable */
#define DSI_CMCR_GSW0TX_Pos         (8U)
#define DSI_CMCR_GSW0TX_Msk         (0x1UL << DSI_CMCR_GSW0TX_Pos)        /*!< 0x00000100 */
#define DSI_CMCR_GSW0TX             DSI_CMCR_GSW0TX_Msk                  /*!< Generic short write zero parameters transmission */
#define DSI_CMCR_GSW1TX_Pos         (9U)
#define DSI_CMCR_GSW1TX_Msk         (0x1UL << DSI_CMCR_GSW1TX_Pos)        /*!< 0x00000200 */
#define DSI_CMCR_GSW1TX             DSI_CMCR_GSW1TX_Msk                  /*!< Generic short write one parameters transmission */
#define DSI_CMCR_GSW2TX_Pos         (10U)
#define DSI_CMCR_GSW2TX_Msk         (0x1UL << DSI_CMCR_GSW2TX_Pos)        /*!< 0x00000400 */
#define DSI_CMCR_GSW2TX             DSI_CMCR_GSW2TX_Msk                  /*!< Generic short write two parameters transmission */
#define DSI_CMCR_GSR0TX_Pos         (11U)
#define DSI_CMCR_GSR0TX_Msk         (0x1UL << DSI_CMCR_GSR0TX_Pos)        /*!< 0x00000800 */
#define DSI_CMCR_GSR0TX             DSI_CMCR_GSR0TX_Msk                  /*!< Generic short read zero parameters transmission */
#define DSI_CMCR_GSR1TX_Pos         (12U)
#define DSI_CMCR_GSR1TX_Msk         (0x1UL << DSI_CMCR_GSR1TX_Pos)        /*!< 0x00001000 */
#define DSI_CMCR_GSR1TX             DSI_CMCR_GSR1TX_Msk                  /*!< Generic short read one parameters transmission */
#define DSI_CMCR_GSR2TX_Pos         (13U)
#define DSI_CMCR_GSR2TX_Msk         (0x1UL << DSI_CMCR_GSR2TX_Pos)        /*!< 0x00002000 */
#define DSI_CMCR_GSR2TX             DSI_CMCR_GSR2TX_Msk                  /*!< Generic short read two parameters transmission */
#define DSI_CMCR_GLWTX_Pos          (14U)
#define DSI_CMCR_GLWTX_Msk          (0x1UL << DSI_CMCR_GLWTX_Pos)         /*!< 0x00004000 */
#define DSI_CMCR_GLWTX              DSI_CMCR_GLWTX_Msk                   /*!< Generic long write transmission */
#define DSI_CMCR_DSW0TX_Pos         (16U)
#define DSI_CMCR_DSW0TX_Msk         (0x1UL << DSI_CMCR_DSW0TX_Pos)        /*!< 0x00010000 */
#define DSI_CMCR_DSW0TX             DSI_CMCR_DSW0TX_Msk                  /*!< DCS short write zero parameter transmission */
#define DSI_CMCR_DSW1TX_Pos         (17U)
#define DSI_CMCR_DSW1TX_Msk         (0x1UL << DSI_CMCR_DSW1TX_Pos)        /*!< 0x00020000 */
#define DSI_CMCR_DSW1TX             DSI_CMCR_DSW1TX_Msk                  /*!< DCS short read one parameter transmission */
#define DSI_CMCR_DSR0TX_Pos         (18U)
#define DSI_CMCR_DSR0TX_Msk         (0x1UL << DSI_CMCR_DSR0TX_Pos)        /*!< 0x00040000 */
#define DSI_CMCR_DSR0TX             DSI_CMCR_DSR0TX_Msk                  /*!< DCS short read zero parameter transmission */
#define DSI_CMCR_DLWTX_Pos          (19U)
#define DSI_CMCR_DLWTX_Msk          (0x1UL << DSI_CMCR_DLWTX_Pos)         /*!< 0x00080000 */
#define DSI_CMCR_DLWTX              DSI_CMCR_DLWTX_Msk                   /*!< DCS long write transmission */
#define DSI_CMCR_MRDPS_Pos          (24U)
#define DSI_CMCR_MRDPS_Msk          (0x1UL << DSI_CMCR_MRDPS_Pos)         /*!< 0x01000000 */
#define DSI_CMCR_MRDPS              DSI_CMCR_MRDPS_Msk                   /*!< Maximum read packet size */

